---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.JoiningDisjointWarn
source: html/79941f65-e2f5-519c-3ec7-3ca77188ab07.htm
---
# Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.JoiningDisjointWarn Property

Highlighted elements are joined but do not intersect.

## Syntax (C#)
```csharp
public static FailureDefinitionId JoiningDisjointWarn { get; }
```